In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as ply

In [2]:
data = pd.read_csv("Study Data\Data.csv")
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [3]:
# Handling Catagoriacal Data by Pandas
pd.get_dummies(data['Purchased'])

   No  Yes
0   1    0
1   0    1
2   1    0
3   1    0
4   0    1
5   0    1
6   1    0
7   0    1
8   1    0
9   0    1

In [13]:
data

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          1
1    Spain  27.0  48000.0          0
2  Germany  30.0  54000.0          1
3    Spain  38.0  61000.0          1
4  Germany  40.0      NaN          0
5   France  35.0  58000.0          0
6    Spain   NaN  52000.0          1
7   France  48.0  79000.0          0
8  Germany  50.0  83000.0          1
9   France  37.0  67000.0          0

In [7]:
data

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          1
1    Spain  27.0  48000.0          0
2  Germany  30.0  54000.0          1
3    Spain  38.0  61000.0          1
4  Germany  40.0      NaN          0
5   France  35.0  58000.0          0
6    Spain   NaN  52000.0          1
7   France  48.0  79000.0          0
8  Germany  50.0  83000.0          1
9   France  37.0  67000.0          0